karelhutajulu/Embedded/esp32_ism330dlc_driver-1/src/ism330dlc_reg.h
#define ISM330DLC_CTRL2_OIS                    0x71U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t hp_en_ois                : 1;
  uint8_t ftype_ois                : 2;
  uint8_t not_used_01              : 1;
  uint8_t hpm_ois                  : 2;
  uint8_t not_used_02              : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_02              : 2;
  uint8_t hpm_ois                  : 2;
  uint8_t not_used_01              : 1;
  uint8_t ftype_ois                : 2;
  uint8_t hp_en_ois                : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dlc_ctrl2_ois_t;

#define ISM330DLC_CTRL3_OIS                    0x72U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t st_ois_clampdis          : 1;
  uint8_t st_ois                   : 2;
  uint8_t filter_xl_conf_ois       : 2;
  uint8_t fs_xl_ois                : 2;
  uint8_t den_lh_ois               : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t den_lh_ois               : 1;
  uint8_t fs_xl_ois                : 2;
  uint8_t filter_xl_conf_ois       : 2;
  uint8_t st_ois                   : 2;
  uint8_t st_ois_clampdis          : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dlc_ctrl3_ois_t;

#define ISM330DLC_X_OFS_USR                    0x73U
#define ISM330DLC_Y_OFS_USR                    0x74U
#define ISM330DLC_Z_OFS_USR                    0x75U
#define ISM330DLC_SLV0_ADD                     0x02U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t rw_0                     : 1;
  uint8_t slave0_add               : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave0_add               : 7;
  uint8_t rw_0                     : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dlc_slv0_add_t;

#define ISM330DLC_SLV0_SUBADD                  0x03U
typedef struct
{
  uint8_t slave0_reg               : 8;
} ism330dlc_slv0_subadd_t;

#define ISM330DLC_SLAVE0_CONFIG                0x04U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave0_numop             : 3;
  uint8_t src_mode                 : 1;
  uint8_t aux_sens_on              : 2;
  uint8_t slave0_rate              : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave0_rate              : 2;
  uint8_t aux_sens_on              : 2;
  uint8_t src_mode                 : 1;
  uint8_t slave0_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} ism330dlc_slave0_config_t;

#define ISM330DLC_SLV1_ADD                     0x05U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_1                      : 1;
  uint8_t slave1_add               : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave1_add               : 7;
  uint8_t r_1                      : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dlc_slv1_add_t;

#define ISM330DLC_SLV1_SUBADD                  0x06U
typedef struct
{
  uint8_t slave1_reg               : 8;
} ism330dlc_slv1_subadd_t;

#define ISM330DLC_SLAVE1_CONFIG                0x07U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave1_numop             : 3;
  uint8_t not_used_01              : 2;
  uint8_t write_once               : 1;
  uint8_t slave1_rate              : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave1_rate              : 2;
  uint8_t write_once               : 1;
  uint8_t not_used_01              : 2;
  uint8_t slave1_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} ism330dlc_slave1_config_t;

#define ISM330DLC_SLV2_ADD                     0x08U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_2                      : 1;
  uint8_t slave2_add               : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave2_add               : 7;
  uint8_t r_2                      : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dlc_slv2_add_t;

#define ISM330DLC_SLV2_SUBADD                  0x09U
typedef struct
{
  uint8_t slave2_reg               : 8;
} ism330dlc_slv2_subadd_t;

#define ISM330DLC_SLAVE2_CONFIG                0x0AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave2_numop             : 3;
  uint8_t not_used_01              : 3;
  uint8_t slave2_rate              : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave2_rate              : 2;
  uint8_t not_used_01              : 3;
  uint8_t slave2_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} ism330dlc_slave2_config_t;

#define ISM330DLC_SLV3_ADD                     0x0BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_3                      : 1;
  uint8_t slave3_add               : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave3_add               : 7;
  uint8_t r_3                      : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dlc_slv3_add_t;

#define ISM330DLC_SLV3_SUBADD                  0x0CU
typedef struct
{
  uint8_t slave3_reg               : 8;
} ism330dlc_slv3_subadd_t;

#define ISM330DLC_SLAVE3_CONFIG                0x0DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave3_numop             : 3;
  uint8_t not_used_01              : 3;
  uint8_t slave3_rate              : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave3_rate              : 2;
  uint8_t not_used_01              : 3;
  uint8_t slave3_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} ism330dlc_slave3_config_t;

#define ISM330DLC_DATAWRITE_SRC_MODE_SUB_SLV0  0x0EU
typedef struct
{
  uint8_t slave_dataw              : 8;
} ism330dlc_datawrite_src_mode_sub_slv0_t;

#define ISM330DLC_MAG_SI_XX                    0x24U
#define ISM330DLC_MAG_SI_XY                    0x25U
#define ISM330DLC_MAG_SI_XZ                    0x26U
#define ISM330DLC_MAG_SI_YX                    0x27U
#define ISM330DLC_MAG_SI_YY                    0x28U
#define ISM330DLC_MAG_SI_YZ                    0x29U
#define ISM330DLC_MAG_SI_ZX                    0x2AU
#define ISM330DLC_MAG_SI_ZY                    0x2BU
#define ISM330DLC_MAG_SI_ZZ                    0x2CU
#define ISM330DLC_MAG_OFFX_L                   0x2DU
#define ISM330DLC_MAG_OFFX_H                   0x2EU
#define ISM330DLC_MAG_OFFY_L                   0x2FU
#define ISM330DLC_MAG_OFFY_H                   0x30U
#define ISM330DLC_MAG_OFFZ_L                   0x31U
#define ISM330DLC_MAG_OFFZ_H                   0x32U

/**
  * @defgroup ISM330DLC_Register_Union
  * @brief    This union group all the registers having a bit-field
  *           description.
  *           This union is useful but it's not needed by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union
{
  ism330dlc_func_cfg_access_t                  func_cfg_access;
  ism330dlc_sensor_sync_time_frame_t           sensor_sync_time_frame;
  ism330dlc_sensor_sync_res_ratio_t            sensor_sync_res_ratio;
  ism330dlc_fifo_ctrl1_t                       fifo_ctrl1;
  ism330dlc_fifo_ctrl2_t                       fifo_ctrl2;
  ism330dlc_fifo_ctrl3_t                       fifo_ctrl3;
  ism330dlc_fifo_ctrl4_t                       fifo_ctrl4;
  ism330dlc_fifo_ctrl5_t                       fifo_ctrl5;
  ism330dlc_drdy_pulse_cfg_t                   drdy_pulse_cfg;
  ism330dlc_int1_ctrl_t                        int1_ctrl;
  ism330dlc_int2_ctrl_t                        int2_ctrl;
  ism330dlc_ctrl1_xl_t                         ctrl1_xl;
  ism330dlc_ctrl2_g_t                          ctrl2_g;
  ism330dlc_ctrl3_c_t                          ctrl3_c;
  ism330dlc_ctrl4_c_t                          ctrl4_c;
  ism330dlc_ctrl5_c_t                          ctrl5_c;
  ism330dlc_ctrl6_c_t                          ctrl6_c;
  ism330dlc_ctrl7_g_t                          ctrl7_g;
  ism330dlc_ctrl8_xl_t                         ctrl8_xl;
  ism330dlc_ctrl9_xl_t                         ctrl9_xl;
  ism330dlc_ctrl10_c_t                         ctrl10_c;
  ism330dlc_master_config_t                    master_config;
  ism330dlc_wake_up_src_t                      wake_up_src;
  ism330dlc_tap_src_t                          tap_src;
  ism330dlc_d6d_src_t                          d6d_src;
  ism330dlc_status_reg_t                       status_reg;
  ism330dlc_status_spiaux_t                    status_spiaux;
  ism330dlc_sensorhub1_reg_t                   sensorhub1_reg;
  ism330dlc_sensorhub2_reg_t                   sensorhub2_reg;
  ism330dlc_sensorhub3_reg_t                   sensorhub3_reg;
  ism330dlc_sensorhub4_reg_t                   sensorhub4_reg;
  ism330dlc_sensorhub5_reg_t                   sensorhub5_reg;
  ism330dlc_sensorhub6_reg_t                   sensorhub6_reg;
  ism330dlc_sensorhub7_reg_t                   sensorhub7_reg;
  ism330dlc_sensorhub8_reg_t                   sensorhub8_reg;
  ism330dlc_sensorhub9_reg_t                   sensorhub9_reg;
  ism330dlc_sensorhub10_reg_t                  sensorhub10_reg;
  ism330dlc_sensorhub11_reg_t                  sensorhub11_reg;
  ism330dlc_sensorhub12_reg_t                  sensorhub12_reg;
  ism330dlc_fifo_status1_t                     fifo_status1;
  ism330dlc_fifo_status2_t                     fifo_status2;
  ism330dlc_fifo_status3_t                     fifo_status3;
  ism330dlc_fifo_status4_t                     fifo_status4;
  ism330dlc_sensorhub13_reg_t                  sensorhub13_reg;
  ism330dlc_sensorhub14_reg_t                  sensorhub14_reg;
  ism330dlc_sensorhub15_reg_t                  sensorhub15_reg;
  ism330dlc_sensorhub16_reg_t                  sensorhub16_reg;
  ism330dlc_sensorhub17_reg_t                  sensorhub17_reg;
  ism330dlc_sensorhub18_reg_t                  sensorhub18_reg;
  ism330dlc_func_src1_t                        func_src1;
  ism330dlc_func_src2_t                        func_src2;
  ism330dlc_tap_cfg_t                          tap_cfg;
  ism330dlc_tap_ths_6d_t                       tap_ths_6d;
  ism330dlc_int_dur2_t                         int_dur2;
  ism330dlc_wake_up_ths_t                      wake_up_ths;
  ism330dlc_wake_up_dur_t                      wake_up_dur;
  ism330dlc_free_fall_t                        free_fall;
  ism330dlc_md1_cfg_t                          md1_cfg;
  ism330dlc_md2_cfg_t                          md2_cfg;
  ism330dlc_master_cmd_code_t                  master_cmd_code;
  ism330dlc_sens_sync_spi_error_code_t         sens_sync_spi_error_code;
  ism330dlc_int_ois_t                          int_ois;
  ism330dlc_ctrl1_ois_t                        ctrl1_ois;
  ism330dlc_ctrl2_ois_t                        ctrl2_ois;
  ism330dlc_ctrl3_ois_t                        ctrl3_ois;
  ism330dlc_slv0_add_t                         slv0_add;
  ism330dlc_slv0_subadd_t                      slv0_subadd;
  ism330dlc_slave0_config_t                    slave0_config;
  ism330dlc_slv1_add_t                         slv1_add;
  ism330dlc_slv1_subadd_t                      slv1_subadd;
  ism330dlc_slave1_config_t                    slave1_config;
  ism330dlc_slv2_add_t                         slv2_add;
  ism330dlc_slv2_subadd_t                      slv2_subadd;
  ism330dlc_slave2_config_t                    slave2_config;
  ism330dlc_slv3_add_t                         slv3_add;
  ism330dlc_slv3_subadd_t                      slv3_subadd;
  ism330dlc_slave3_config_t                    slave3_config;
  ism330dlc_datawrite_src_mode_sub_slv0_t
  datawrite_src_mode_sub_slv0;
  bitwise_t                                    bitwise;
  uint8_t                                      byte;
} ism330dlc_reg_t;

/**
  * @}
  *
  */

