karelhutajulu/Embedded/esp32_ism330dlc_driver-1/src/ism330dlc_reg.h
typedef enum
{
  ISM330DLC_ROUND_DISABLE            = 0,
  ISM330DLC_ROUND_XL                 = 1,
  ISM330DLC_ROUND_GY                 = 2,
  ISM330DLC_ROUND_GY_XL              = 3,
  ISM330DLC_ROUND_SH1_TO_SH6         = 4,
  ISM330DLC_ROUND_XL_SH1_TO_SH6      = 5,
  ISM330DLC_ROUND_GY_XL_SH1_TO_SH12  = 6,
  ISM330DLC_ROUND_GY_XL_SH1_TO_SH6   = 7,
} ism330dlc_rounding_t;
int32_t ism330dlc_rounding_mode_set(stmdev_ctx_t *ctx,
                                    ism330dlc_rounding_t val);
int32_t ism330dlc_rounding_mode_get(stmdev_ctx_t *ctx,
                                    ism330dlc_rounding_t *val);

int32_t ism330dlc_temperature_raw_get(stmdev_ctx_t *ctx,
                                      int16_t *val);

int32_t ism330dlc_angular_rate_raw_get(stmdev_ctx_t *ctx,
                                       int16_t *val);

int32_t ism330dlc_acceleration_raw_get(stmdev_ctx_t *ctx,
                                       int16_t *val);

int32_t ism330dlc_mag_calibrated_raw_get(stmdev_ctx_t *ctx,
                                         int16_t *val);

int32_t ism330dlc_fifo_raw_data_get(stmdev_ctx_t *ctx,
                                    uint8_t *buffer,
                                    uint8_t len);

typedef enum
{
  ISM330DLC_USER_BANK   = 0,
  ISM330DLC_BANK_A      = 1,
} ism330dlc_func_cfg_en_t;
int32_t ism330dlc_mem_bank_set(stmdev_ctx_t *ctx,
                               ism330dlc_func_cfg_en_t val);
int32_t ism330dlc_mem_bank_get(stmdev_ctx_t *ctx,
                               ism330dlc_func_cfg_en_t *val);

typedef enum
{
  ISM330DLC_DRDY_LATCHED    = 0,
  ISM330DLC_DRDY_PULSED     = 1,
} ism330dlc_drdy_pulsed_t;
int32_t ism330dlc_data_ready_mode_set(stmdev_ctx_t *ctx,
                                      ism330dlc_drdy_pulsed_t val);
int32_t ism330dlc_data_ready_mode_get(stmdev_ctx_t *ctx,
                                      ism330dlc_drdy_pulsed_t *val);

int32_t ism330dlc_device_id_get(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t ism330dlc_reset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_reset_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DLC_LSB_AT_LOW_ADD  = 0,
  ISM330DLC_MSB_AT_LOW_ADD  = 1,
} ism330dlc_ble_t;
int32_t ism330dlc_data_format_set(stmdev_ctx_t *ctx,
                                  ism330dlc_ble_t val);
int32_t ism330dlc_data_format_get(stmdev_ctx_t *ctx,
                                  ism330dlc_ble_t *val);

int32_t ism330dlc_auto_increment_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_auto_increment_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_boot_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_boot_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DLC_XL_ST_DISABLE    = 0,
  ISM330DLC_XL_ST_POSITIVE   = 1,
  ISM330DLC_XL_ST_NEGATIVE   = 2,
} ism330dlc_st_xl_t;
int32_t ism330dlc_xl_self_test_set(stmdev_ctx_t *ctx,
                                   ism330dlc_st_xl_t val);
int32_t ism330dlc_xl_self_test_get(stmdev_ctx_t *ctx,
                                   ism330dlc_st_xl_t *val);

typedef enum
{
  ISM330DLC_GY_ST_DISABLE    = 0,
  ISM330DLC_GY_ST_POSITIVE   = 1,
  ISM330DLC_GY_ST_NEGATIVE   = 3,
} ism330dlc_st_g_t;
int32_t ism330dlc_gy_self_test_set(stmdev_ctx_t *ctx,
                                   ism330dlc_st_g_t val);
int32_t ism330dlc_gy_self_test_get(stmdev_ctx_t *ctx,
                                   ism330dlc_st_g_t *val);

int32_t ism330dlc_filter_settling_mask_set(stmdev_ctx_t *ctx,
                                           uint8_t val);
int32_t ism330dlc_filter_settling_mask_get(stmdev_ctx_t *ctx,
                                           uint8_t *val);

typedef enum
{
  ISM330DLC_USE_SLOPE = 0,
  ISM330DLC_USE_HPF   = 1,
} ism330dlc_slope_fds_t;
int32_t ism330dlc_xl_hp_path_internal_set(stmdev_ctx_t *ctx,
                                          ism330dlc_slope_fds_t val);
int32_t ism330dlc_xl_hp_path_internal_get(stmdev_ctx_t *ctx,
                                          ism330dlc_slope_fds_t *val);

typedef enum
{
  ISM330DLC_XL_ANA_BW_1k5Hz = 0,
  ISM330DLC_XL_ANA_BW_400Hz = 1,
} ism330dlc_bw0_xl_t;
int32_t ism330dlc_xl_filter_analog_set(stmdev_ctx_t *ctx,
                                       ism330dlc_bw0_xl_t val);
int32_t ism330dlc_xl_filter_analog_get(stmdev_ctx_t *ctx,
                                       ism330dlc_bw0_xl_t *val);

typedef enum
{
  ISM330DLC_XL_LP1_ODR_DIV_2 = 0,
  ISM330DLC_XL_LP1_ODR_DIV_4 = 1,
  ISM330DLC_XL_LP1_NA        = 2,
} ism330dlc_lpf1_bw_sel_t;
int32_t ism330dlc_xl_lp1_bandwidth_set(stmdev_ctx_t *ctx,
                                       ism330dlc_lpf1_bw_sel_t val);
int32_t ism330dlc_xl_lp1_bandwidth_get(stmdev_ctx_t *ctx,
                                       ism330dlc_lpf1_bw_sel_t *val);

typedef enum
{
  ISM330DLC_XL_LOW_LAT_LP_ODR_DIV_50     = 0x00,
  ISM330DLC_XL_LOW_LAT_LP_ODR_DIV_100    = 0x01,
  ISM330DLC_XL_LOW_LAT_LP_ODR_DIV_9      = 0x02,
  ISM330DLC_XL_LOW_LAT_LP_ODR_DIV_400    = 0x03,
  ISM330DLC_XL_LOW_NOISE_LP_ODR_DIV_50   = 0x10,
  ISM330DLC_XL_LOW_NOISE_LP_ODR_DIV_100  = 0x11,
  ISM330DLC_XL_LOW_NOISE_LP_ODR_DIV_9    = 0x12,
  ISM330DLC_XL_LOW_NOISE_LP_ODR_DIV_400  = 0x13,
  ISM330DLC_XL_LP_NA                     = 0x14
} ism330dlc_input_composite_t;
int32_t ism330dlc_xl_lp2_bandwidth_set(stmdev_ctx_t *ctx,
                                       ism330dlc_input_composite_t val);
int32_t ism330dlc_xl_lp2_bandwidth_get(stmdev_ctx_t *ctx,
                                       ism330dlc_input_composite_t *val);

int32_t ism330dlc_xl_reference_mode_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t ism330dlc_xl_reference_mode_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef enum
{
  ISM330DLC_XL_HP_ODR_DIV_4      = 0x00, /* Slope filter */
  ISM330DLC_XL_HP_ODR_DIV_100    = 0x01,
  ISM330DLC_XL_HP_ODR_DIV_9      = 0x02,
  ISM330DLC_XL_HP_ODR_DIV_400    = 0x03,
  ISM330DLC_XL_HP_NA             = 0x04,
} ism330dlc_hpcf_xl_t;
int32_t ism330dlc_xl_hp_bandwidth_set(stmdev_ctx_t *ctx,
                                      ism330dlc_hpcf_xl_t val);
int32_t ism330dlc_xl_hp_bandwidth_get(stmdev_ctx_t *ctx,
                                      ism330dlc_hpcf_xl_t *val);

