karelhutajulu/Embedded/esp32_ism330dlc_driver-1/src/ism330dlc_reg.h
typedef enum
{
  ISM330DLC_AUX_2g   = 0,
  ISM330DLC_AUX_16g  = 1,
  ISM330DLC_AUX_4g   = 2,
  ISM330DLC_AUX_8g   = 3,
} ism330dlc_fs_xl_ois_t;
int32_t ism330dlc_aux_xl_full_scale_set(stmdev_ctx_t *ctx,
                                        ism330dlc_fs_xl_ois_t val);
int32_t ism330dlc_aux_xl_full_scale_get(stmdev_ctx_t *ctx,
                                        ism330dlc_fs_xl_ois_t *val);

typedef enum
{
  ISM330DLC_AUX_DEN_ACTIVE_LOW   = 0,
  ISM330DLC_AUX_DEN_ACTIVE_HIGH  = 1,
} ism330dlc_den_lh_ois_t;
int32_t ism330dlc_aux_den_polarity_set(stmdev_ctx_t *ctx,
                                       ism330dlc_den_lh_ois_t val);
int32_t ism330dlc_aux_den_polarity_get(stmdev_ctx_t *ctx,
                                       ism330dlc_den_lh_ois_t *val);

typedef enum
{
  ISM330DLC_SPI_4_WIRE  = 0,
  ISM330DLC_SPI_3_WIRE  = 1,
} ism330dlc_sim_t;
int32_t ism330dlc_spi_mode_set(stmdev_ctx_t *ctx,
                               ism330dlc_sim_t val);
int32_t ism330dlc_spi_mode_get(stmdev_ctx_t *ctx,
                               ism330dlc_sim_t *val);

typedef enum
{
  ISM330DLC_I2C_ENABLE   = 0,
  ISM330DLC_I2C_DISABLE  = 1,
} ism330dlc_i2c_disable_t;
int32_t ism330dlc_i2c_interface_set(stmdev_ctx_t *ctx,
                                    ism330dlc_i2c_disable_t val);
int32_t ism330dlc_i2c_interface_get(stmdev_ctx_t *ctx,
                                    ism330dlc_i2c_disable_t *val);

typedef struct
{
  uint8_t int1_drdy_xl             : 1;
  uint8_t int1_drdy_g              : 1;
  uint8_t int1_boot                : 1;
  uint8_t int1_fth                 : 1;
  uint8_t int1_fifo_ovr            : 1;
  uint8_t int1_full_flag           : 1;
  uint8_t int1_tilt                : 1;
  uint8_t int1_6d                  : 1;
  uint8_t int1_double_tap          : 1;
  uint8_t int1_ff                  : 1;
  uint8_t int1_wu                  : 1;
  uint8_t int1_single_tap          : 1;
  uint8_t int1_inact_state         : 1;
  uint8_t den_drdy_int1            : 1;
  uint8_t drdy_on_int1             : 1;
} ism330dlc_int1_route_t;
int32_t ism330dlc_pin_int1_route_set(stmdev_ctx_t *ctx,
                                     ism330dlc_int1_route_t val);
int32_t ism330dlc_pin_int1_route_get(stmdev_ctx_t *ctx,
                                     ism330dlc_int1_route_t *val);

typedef struct
{
  uint8_t int2_drdy_xl             : 1;
  uint8_t int2_drdy_g              : 1;
  uint8_t int2_drdy_temp           : 1;
  uint8_t int2_fth                 : 1;
  uint8_t int2_fifo_ovr            : 1;
  uint8_t int2_full_flag           : 1;
  uint8_t int2_iron                : 1;
  uint8_t int2_tilt                : 1;
  uint8_t int2_6d                  : 1;
  uint8_t int2_double_tap          : 1;
  uint8_t int2_ff                  : 1;
  uint8_t int2_wu                  : 1;
  uint8_t int2_single_tap          : 1;
  uint8_t int2_inact_state         : 1;
} ism330dlc_int2_route_t;
int32_t ism330dlc_pin_int2_route_set(stmdev_ctx_t *ctx,
                                     ism330dlc_int2_route_t val);
int32_t ism330dlc_pin_int2_route_get(stmdev_ctx_t *ctx,
                                     ism330dlc_int2_route_t *val);

typedef enum
{
  ISM330DLC_PUSH_PULL   = 0,
  ISM330DLC_OPEN_DRAIN  = 1,
} ism330dlc_pp_od_t;
int32_t ism330dlc_pin_mode_set(stmdev_ctx_t *ctx,
                               ism330dlc_pp_od_t val);
int32_t ism330dlc_pin_mode_get(stmdev_ctx_t *ctx,
                               ism330dlc_pp_od_t *val);

typedef enum
{
  ISM330DLC_ACTIVE_HIGH   = 0,
  ISM330DLC_ACTIVE_LOW    = 1,
} ism330dlc_h_lactive_t;
int32_t ism330dlc_pin_polarity_set(stmdev_ctx_t *ctx,
                                   ism330dlc_h_lactive_t val);
int32_t ism330dlc_pin_polarity_get(stmdev_ctx_t *ctx,
                                   ism330dlc_h_lactive_t *val);

int32_t ism330dlc_all_on_int1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_all_on_int1_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DLC_INT_PULSED   = 0,
  ISM330DLC_INT_LATCHED  = 1,
} ism330dlc_lir_t;
int32_t ism330dlc_int_notification_set(stmdev_ctx_t *ctx,
                                       ism330dlc_lir_t val);
int32_t ism330dlc_int_notification_get(stmdev_ctx_t *ctx,
                                       ism330dlc_lir_t *val);

int32_t ism330dlc_wkup_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_wkup_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_wkup_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_wkup_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_gy_sleep_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_gy_sleep_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DLC_PROPERTY_DISABLE          = 0,
  ISM330DLC_XL_12Hz5_GY_NOT_AFFECTED  = 1,
  ISM330DLC_XL_12Hz5_GY_SLEEP         = 2,
  ISM330DLC_XL_12Hz5_GY_PD            = 3,
} ism330dlc_inact_en_t;
int32_t ism330dlc_act_mode_set(stmdev_ctx_t *ctx,
                               ism330dlc_inact_en_t val);
int32_t ism330dlc_act_mode_get(stmdev_ctx_t *ctx,
                               ism330dlc_inact_en_t *val);

int32_t ism330dlc_act_sleep_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_act_sleep_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tap_src_get(stmdev_ctx_t *ctx,
                              ism330dlc_tap_src_t *val);

int32_t ism330dlc_tap_detection_on_z_set(stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t ism330dlc_tap_detection_on_z_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t ism330dlc_tap_detection_on_y_set(stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t ism330dlc_tap_detection_on_y_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t ism330dlc_tap_detection_on_x_set(stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t ism330dlc_tap_detection_on_x_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t ism330dlc_tap_threshold_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tap_threshold_x_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t ism330dlc_tap_shock_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tap_shock_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tap_quiet_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tap_quiet_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tap_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tap_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

