karelhutajulu/Embedded/esp32_ism330dlc_driver-1/src/ism330dlc_reg.h
typedef enum
{
  ISM330DLC_ONLY_SINGLE          = 0,
  ISM330DLC_BOTH_SINGLE_DOUBLE   = 1,
} ism330dlc_single_double_tap_t;
int32_t ism330dlc_tap_mode_set(stmdev_ctx_t *ctx,
                               ism330dlc_single_double_tap_t val);
int32_t ism330dlc_tap_mode_get(stmdev_ctx_t *ctx,
                               ism330dlc_single_double_tap_t *val);

typedef enum
{
  ISM330DLC_ODR_DIV_2_FEED      = 0,
  ISM330DLC_LPF2_FEED           = 1,
} ism330dlc_low_pass_on_6d_t;
int32_t ism330dlc_6d_feed_data_set(stmdev_ctx_t *ctx,
                                   ism330dlc_low_pass_on_6d_t val);
int32_t ism330dlc_6d_feed_data_get(stmdev_ctx_t *ctx,
                                   ism330dlc_low_pass_on_6d_t *val);

typedef enum
{
  ISM330DLC_DEG_80      = 0,
  ISM330DLC_DEG_70      = 1,
  ISM330DLC_DEG_60      = 2,
  ISM330DLC_DEG_50      = 3,
} ism330dlc_sixd_ths_t;
int32_t ism330dlc_6d_threshold_set(stmdev_ctx_t *ctx,
                                   ism330dlc_sixd_ths_t val);
int32_t ism330dlc_6d_threshold_get(stmdev_ctx_t *ctx,
                                   ism330dlc_sixd_ths_t *val);

int32_t ism330dlc_4d_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_4d_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_ff_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_ff_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DLC_FF_TSH_156mg = 0,
  ISM330DLC_FF_TSH_219mg = 1,
  ISM330DLC_FF_TSH_250mg = 2,
  ISM330DLC_FF_TSH_312mg = 3,
  ISM330DLC_FF_TSH_344mg = 4,
  ISM330DLC_FF_TSH_406mg = 5,
  ISM330DLC_FF_TSH_469mg = 6,
  ISM330DLC_FF_TSH_500mg = 7,
} ism330dlc_ff_ths_t;
int32_t ism330dlc_ff_threshold_set(stmdev_ctx_t *ctx,
                                   ism330dlc_ff_ths_t val);
int32_t ism330dlc_ff_threshold_get(stmdev_ctx_t *ctx,
                                   ism330dlc_ff_ths_t *val);

int32_t ism330dlc_fifo_watermark_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t ism330dlc_fifo_watermark_get(stmdev_ctx_t *ctx,
                                     uint16_t *val);

int32_t ism330dlc_fifo_data_level_get(stmdev_ctx_t *ctx,
                                      uint16_t *val);

int32_t ism330dlc_fifo_wtm_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_fifo_pattern_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t ism330dlc_fifo_temp_batch_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_fifo_temp_batch_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum
{
  ISM330DLC_TRG_XL_GY_DRDY     = 0,
  ISM330DLC_TRG_SH_DRDY        = 1,
} ism330dlc_trigger_fifo_t;
int32_t ism330dlc_fifo_write_trigger_set(stmdev_ctx_t *ctx,
                                         ism330dlc_trigger_fifo_t val);
int32_t ism330dlc_fifo_write_trigger_get(stmdev_ctx_t *ctx,
                                         ism330dlc_trigger_fifo_t *val);

typedef enum
{
  ISM330DLC_FIFO_XL_DISABLE  = 0,
  ISM330DLC_FIFO_XL_NO_DEC   = 1,
  ISM330DLC_FIFO_XL_DEC_2    = 2,
  ISM330DLC_FIFO_XL_DEC_3    = 3,
  ISM330DLC_FIFO_XL_DEC_4    = 4,
  ISM330DLC_FIFO_XL_DEC_8    = 5,
  ISM330DLC_FIFO_XL_DEC_16   = 6,
  ISM330DLC_FIFO_XL_DEC_32   = 7,
} ism330dlc_dec_fifo_xl_t;
int32_t ism330dlc_fifo_xl_batch_set(stmdev_ctx_t *ctx,
                                    ism330dlc_dec_fifo_xl_t val);
int32_t ism330dlc_fifo_xl_batch_get(stmdev_ctx_t *ctx,
                                    ism330dlc_dec_fifo_xl_t *val);

typedef enum
{
  ISM330DLC_FIFO_GY_DISABLE = 0,
  ISM330DLC_FIFO_GY_NO_DEC  = 1,
  ISM330DLC_FIFO_GY_DEC_2   = 2,
  ISM330DLC_FIFO_GY_DEC_3   = 3,
  ISM330DLC_FIFO_GY_DEC_4   = 4,
  ISM330DLC_FIFO_GY_DEC_8   = 5,
  ISM330DLC_FIFO_GY_DEC_16  = 6,
  ISM330DLC_FIFO_GY_DEC_32  = 7,
} ism330dlc_dec_fifo_gyro_t;
int32_t ism330dlc_fifo_gy_batch_set(stmdev_ctx_t *ctx,
                                    ism330dlc_dec_fifo_gyro_t val);
int32_t ism330dlc_fifo_gy_batch_get(stmdev_ctx_t *ctx,
                                    ism330dlc_dec_fifo_gyro_t *val);

typedef enum
{
  ISM330DLC_FIFO_DS3_DISABLE   = 0,
  ISM330DLC_FIFO_DS3_NO_DEC    = 1,
  ISM330DLC_FIFO_DS3_DEC_2     = 2,
  ISM330DLC_FIFO_DS3_DEC_3     = 3,
  ISM330DLC_FIFO_DS3_DEC_4     = 4,
  ISM330DLC_FIFO_DS3_DEC_8     = 5,
  ISM330DLC_FIFO_DS3_DEC_16    = 6,
  ISM330DLC_FIFO_DS3_DEC_32    = 7,
} ism330dlc_dec_ds3_fifo_t;
int32_t ism330dlc_fifo_dataset_3_batch_set(stmdev_ctx_t *ctx,
                                           ism330dlc_dec_ds3_fifo_t val);
int32_t ism330dlc_fifo_dataset_3_batch_get(stmdev_ctx_t *ctx,
                                           ism330dlc_dec_ds3_fifo_t *val);

typedef enum
{
  ISM330DLC_FIFO_DS4_DISABLE  = 0,
  ISM330DLC_FIFO_DS4_NO_DEC   = 1,
  ISM330DLC_FIFO_DS4_DEC_2    = 2,
  ISM330DLC_FIFO_DS4_DEC_3    = 3,
  ISM330DLC_FIFO_DS4_DEC_4    = 4,
  ISM330DLC_FIFO_DS4_DEC_8    = 5,
  ISM330DLC_FIFO_DS4_DEC_16   = 6,
  ISM330DLC_FIFO_DS4_DEC_32   = 7,
} ism330dlc_dec_ds4_fifo_t;
int32_t ism330dlc_fifo_dataset_4_batch_set(stmdev_ctx_t *ctx,
                                           ism330dlc_dec_ds4_fifo_t val);
int32_t ism330dlc_fifo_dataset_4_batch_get(stmdev_ctx_t *ctx,
                                           ism330dlc_dec_ds4_fifo_t *val);

int32_t ism330dlc_fifo_xl_gy_8bit_format_set(stmdev_ctx_t *ctx,
                                             uint8_t val);
int32_t ism330dlc_fifo_xl_gy_8bit_format_get(stmdev_ctx_t *ctx,
                                             uint8_t *val);

int32_t ism330dlc_fifo_stop_on_wtm_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dlc_fifo_stop_on_wtm_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum
{
  ISM330DLC_BYPASS_MODE           = 0,
  ISM330DLC_FIFO_MODE             = 1,
  ISM330DLC_STREAM_TO_FIFO_MODE   = 3,
  ISM330DLC_BYPASS_TO_STREAM_MODE = 4,
  ISM330DLC_STREAM_MODE           = 6,
} ism330dlc_fifo_mode_t;
int32_t ism330dlc_fifo_mode_set(stmdev_ctx_t *ctx,
                                ism330dlc_fifo_mode_t val);
int32_t ism330dlc_fifo_mode_get(stmdev_ctx_t *ctx,
                                ism330dlc_fifo_mode_t *val);

