karelhutajulu/Embedded/esp32_ism330dlc_driver-1/src/ism330dlc_reg.h
typedef enum
{
  ISM330DLC_NORMAL_MODE_READ  = 0,
  ISM330DLC_SRC_MODE_READ     = 1,
} ism330dlc_src_mode_t;
int32_t ism330dlc_sh_cfg_slave_0_rd_mode_set(stmdev_ctx_t *ctx,
                                             ism330dlc_src_mode_t val);
int32_t ism330dlc_sh_cfg_slave_0_rd_mode_get(stmdev_ctx_t *ctx,
                                             ism330dlc_src_mode_t *val);

typedef enum
{
  ISM330DLC_SLV_0        = 0,
  ISM330DLC_SLV_0_1      = 1,
  ISM330DLC_SLV_0_1_2    = 2,
  ISM330DLC_SLV_0_1_2_3  = 3,
} ism330dlc_aux_sens_on_t;
int32_t ism330dlc_sh_num_of_dev_connected_set(stmdev_ctx_t *ctx,
                                              ism330dlc_aux_sens_on_t val);
int32_t ism330dlc_sh_num_of_dev_connected_get(stmdev_ctx_t *ctx,
                                              ism330dlc_aux_sens_on_t *val);

typedef struct
{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} ism330dlc_sh_cfg_write_t;
int32_t ism330dlc_sh_cfg_write(stmdev_ctx_t *ctx,
                               ism330dlc_sh_cfg_write_t *val);

typedef struct
{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} ism330dlc_sh_cfg_read_t;
int32_t ism330dlc_sh_slv0_cfg_read(stmdev_ctx_t *ctx,
                                   ism330dlc_sh_cfg_read_t *val);
int32_t ism330dlc_sh_slv1_cfg_read(stmdev_ctx_t *ctx,
                                   ism330dlc_sh_cfg_read_t *val);
int32_t ism330dlc_sh_slv2_cfg_read(stmdev_ctx_t *ctx,
                                   ism330dlc_sh_cfg_read_t *val);
int32_t ism330dlc_sh_slv3_cfg_read(stmdev_ctx_t *ctx,
                                   ism330dlc_sh_cfg_read_t *val);

typedef enum
{
  ISM330DLC_SL0_NO_DEC   = 0,
  ISM330DLC_SL0_DEC_2    = 1,
  ISM330DLC_SL0_DEC_4    = 2,
  ISM330DLC_SL0_DEC_8    = 3,
} ism330dlc_slave0_rate_t;
int32_t ism330dlc_sh_slave_0_dec_set(stmdev_ctx_t *ctx,
                                     ism330dlc_slave0_rate_t val);
int32_t ism330dlc_sh_slave_0_dec_get(stmdev_ctx_t *ctx,
                                     ism330dlc_slave0_rate_t *val);

typedef enum
{
  ISM330DLC_EACH_SH_CYCLE     = 0,
  ISM330DLC_ONLY_FIRST_CYCLE  = 1,
} ism330dlc_write_once_t;
int32_t ism330dlc_sh_write_mode_set(stmdev_ctx_t *ctx,
                                    ism330dlc_write_once_t val);
int32_t ism330dlc_sh_write_mode_get(stmdev_ctx_t *ctx,
                                    ism330dlc_write_once_t *val);

typedef enum
{
  ISM330DLC_SL1_NO_DEC   = 0,
  ISM330DLC_SL1_DEC_2    = 1,
  ISM330DLC_SL1_DEC_4    = 2,
  ISM330DLC_SL1_DEC_8    = 3,
} ism330dlc_slave1_rate_t;
int32_t ism330dlc_sh_slave_1_dec_set(stmdev_ctx_t *ctx,
                                     ism330dlc_slave1_rate_t val);
int32_t ism330dlc_sh_slave_1_dec_get(stmdev_ctx_t *ctx,
                                     ism330dlc_slave1_rate_t *val);

typedef enum
{
  ISM330DLC_SL2_NO_DEC  = 0,
  ISM330DLC_SL2_DEC_2   = 1,
  ISM330DLC_SL2_DEC_4   = 2,
  ISM330DLC_SL2_DEC_8   = 3,
} ism330dlc_slave2_rate_t;
int32_t ism330dlc_sh_slave_2_dec_set(stmdev_ctx_t *ctx,
                                     ism330dlc_slave2_rate_t val);
int32_t ism330dlc_sh_slave_2_dec_get(stmdev_ctx_t *ctx,
                                     ism330dlc_slave2_rate_t *val);

typedef enum
{
  ISM330DLC_SL3_NO_DEC  = 0,
  ISM330DLC_SL3_DEC_2   = 1,
  ISM330DLC_SL3_DEC_4   = 2,
  ISM330DLC_SL3_DEC_8   = 3,
} ism330dlc_slave3_rate_t;
int32_t ism330dlc_sh_slave_3_dec_set(stmdev_ctx_t *ctx,
                                     ism330dlc_slave3_rate_t val);
int32_t ism330dlc_sh_slave_3_dec_get(stmdev_ctx_t *ctx,
                                     ism330dlc_slave3_rate_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* ISM330DLC_DRIVER_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/